import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import { Product } from './product';
import { ProductCardComponent } from './product-card.component';

@Component({
  selector: 'app-product-list',
  standalone: true,
  imports: [CommonModule, ProductCardComponent],
  templateUrl: './product-list.component.html',
  styleUrls: ['./product-list.component.css'],
})
export class ProductListComponent {
  products: Product[] = [
    {
      id: 142224134,
      name: 'Mutant Creakong+ Creatine',
      description: 'Креатин Mutant Creakong+ шейкер нейтральный 300 г',
      price: 8400,
      rating: 4.8,
      link: 'https://l.kaspi.kz/shop/8eSF27ZyG7taTQn',
      image: 'https://resources.cdn-kaspi.kz/img/m/p/pc4/pd4/52040597.jpg?format=gallery-medium',
    },
{
  id: 1221431315,
  name: 'Холодильник Leadbros HD-400W серый',
  description: `Представляем вам холодильник LEADBROS HD-400W — идеальное сочетание стиля, функциональности и энергетической эффективности. С его помощью вы сможете сохранить продукты свежими и организовать пространство на кухне с максимальным комфортом.

✨ Особенности:
- ✅ Общий объем 400 л — достаточно места для хранения всех ваших продуктов.
- 🔒 Система No Frost — избавляет от необходимости размораживания.
- 🌱 Класс энергопотребления A+ — экономия на счетах за электроэнергию.
- 🔇 Уровень шума 40 дБ — тихая работа, не нарушающая спокойствие.
- ❄️ Инверторный компрессор — обеспечивает стабильную температуру и долговечность.

Этот холодильник идеально подходит для семей, которые ценят простор и современные технологии в быту. Он станет отличным дополнением к любой кухне, обеспечивая надежное хранение продуктов.

Рекомендуем регулярно очищать холодильник и следить за температурным режимом для поддержания оптимальных условий хранения.`,
  price: 274990,
  rating: 5.0,
  link: 'https://l.kaspi.kz/shop/81yy3oxMZvuLoSi',
  image:'https://resources.cdn-kaspi.kz/img/m/p/p66/pfc/85928839.png?format=gallery-medium',
},

    {
      id: 148265326,
      name: 'Дутики Puma белый',
      description: 'Сапоги Tuff Terra HI от PUMA — пара, в которой сочетается стильный спортивный дизайн и функциональность. Отличный выбор для холодных дней.',
      price: 49190,
      rating: 4.2,
      link: 'https://l.kaspi.kz/shop/4DaXu2aWpHTfZCa',
      image:'https://resources.cdn-kaspi.kz/img/m/p/pba/p6a/73486183.jpg?format=gallery-medium',
    },
{
  id: 14814265,
  name: 'Кепка QAZAQ REPUBLIC размер универсальный, бежевый',
  description: `Кепка с мягким изогнутым козырьком. Идеально дополнит любой образ.
- базовая модель
- сзади есть регулятор
- вышитый логотип "qr"
- 100% хлопок`,
  price: 8990,
  rating: 4.9,
  link: 'https://l.kaspi.kz/shop/7hbffTW8MicgeBJ',
  image:'https://resources.cdn-kaspi.kz/img/m/p/pb3/pfc/61845565.jpg?format=gallery-medium',
},
   {
      id: 142224135,
      name: 'Mutant Creakong+ Creatine',
      description: 'Креатин Mutant Creakong+ шейкер нейтральный 300 г',
      price: 8800,
      rating: 4.7,
      link: 'https://l.kaspi.kz/shop/8eSF27ZyG7taTQn',
      image: 'https://resources.cdn-kaspi.kz/img/m/p/pc4/pd4/52040597.jpg?format=gallery-medium',
    },
    {
      id: 156764015,
      name: 'Кеды 11 бежевый',
      description: `Общие характеристики

Код товара:156764015
Модель: кеды
Материал верха: натуральная замша
Внутренний материалнатуральная: кожа
Сезон:демисезон`,
      price: 25000,
      rating: 5,
      link: 'https://l.kaspi.kz/shop/FJXGRef8o1Ta7Vb',
      image:'https://resources.cdn-kaspi.kz/img/m/p/p7c/p9f/104323786.jpeg?format=gallery-medium',
    },
    {
      id: 118980823,
      name: 'Сумка шоппер Mila Studio джинсовая ткань синий',
      description: `Сумка-шоппер Mila Studio — стильный и практичный аксессуар, который станет вашим незаменимым спутником в повседневной жизни. Изготовленная из качественной джинсовой ткани, она сочетает в себе удобство и модный дизайн.

✨ Особенности:
- ✅ Просторный дизайн — достаточно места для всех ваших вещей.
- 🔒 Удобные ручки и плечевой ремень — носите как вам удобно.
- 🌱 Экологичный материал — забота о природе в каждой детали.

Эта сумка идеально подходит для активных людей, которые ценят стиль и функциональность в своих аксессуарах. Она станет отличным выбором для шопинга, прогулок по городу или пляжного отдыха.

Рекомендуем сочетать с другими аксессуарами Mila Studio для создания завершенного образа.`,
      price: 16000,
      rating: 4.4,
      link: 'https://l.kaspi.kz/shop/CFE6xW16sjMxtGb',
      image:'https://resources.cdn-kaspi.kz/img/m/p/hce/hc0/85907675709470.jpg?format=gallery-medium',
    },
    {
      id: 120432327,
      name: 'KAMALI Allure парфюмированный спрей 250 мл, для женщин',
      description: `Парфюмированный спрей KAMALI Allure — освежающий и стойкий аромат для женщин, который подчеркнёт вашу индивидуальность и создаст атмосферу уюта.

✨ Особенности:
- ✅ Стойкость до 24 часов — наслаждайтесь ароматом в течение всего дня.
- 🪨 Древесные ноты — создают глубокий и насыщенный шлейф.
- 🌱 Натуральные компоненты — забота о вашей коже и волосах.

Идеально подходит для женщин, которые ценят стиль и комфорт в повседневной жизни, а также хотят добавить изысканности в свои образы.`,
      price: 3400,
      rating: 3.3,
      link: 'https://l.kaspi.kz/shop/fNoWXhJThRqjbhj',
      image:'https://resources.cdn-kaspi.kz/img/m/p/p08/pb0/54582071.jpeg?format=gallery-medium',
    },
    {
      id: 147643521,
      name: 'Брелок Bags Lab Обвес на сумку',
      description: `Брелок-обвес на сумку или ключи “Пегас”
Стильный и оригинальный аксессуар, который украсит любую сумку, рюкзак или связку ключей. Брелок выполнен в виде лошадки с крыльями из мягкой экокожи, дополнен декоративными шнурами и карабином.`,
      price: 3200,
      rating: 3,
      link: 'https://l.kaspi.kz/shop/8CcFmVVStABwAFq',
      image:'https://resources.cdn-kaspi.kz/img/m/p/p7e/p4d/71423882.jpeg?format=gallery-medium',
    },
    {
      id: 110203637,
      name: 'Игровое кресло ATLANTA ',
      description: `Кресло это игровое кресло, разработанное специально для обеспечения комфорта и поддержки во время длительных игровых сессий. 

Оно имеет анатомическое сиденье с дополнительной амортизацией и высокую спинку для поддержки спины и плеч. 

Кресло также обеспечивает поддержку шеи и поясницы, что помогает снизить нагрузку на мышцы и позвоночник. Предлагает множество возможностей для индивидуальной регулировки высоты, подлокотников, наклона спинки и подголовника. 

Кресло изготовлено из качественных материалов, обеспечивающих мягкость и жёсткость, что позволяет вашим мышцам находиться в правильном положении во время игры. `,
      price: 23400,
      rating: 4.5,
      link:'https://l.kaspi.kz/shop/GW6h8x1xagdkKj8',
      image:'https://resources.cdn-kaspi.kz/img/m/p/hb6/hdf/86657938882590.jpg?format=gallery-medium',
    },
  ];

  trackById(_index: number, p: Product) {
    return p.id;
  }
}
